In [3]:
  import pandas as pd
df1 = pd.DataFrame({
      "city":["new york","chicago","orlando"],
      "temperature": [21,14,35],
  })
df1

       city  temperature
0  new york           21
1   chicago           14
2   orlando           35

In [4]:
df2 = pd.DataFrame({
      "city":["new york","chicago","orlando"],
      "humidity": [68,65,75]
  })
df2

       city  humidity
0  new york        68
1   chicago        65
2   orlando        75

In [5]:
df3 = pd.merge(df1,df2,on="city")
df3

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [6]:
df3 = pd.merge(df1,df2,on="city", how= "outer")
df3

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [7]:
df3 = pd.merge(df1,df2,on="city",how= "inner")
df3

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [8]:
df3 = pd.merge(df1,df2,on="city",how= "left")
df3

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [10]:
df3 = pd.merge(df1,df2,on="city",how= "outer",indicator=True)
df3

       city  temperature  humidity _merge
0  new york           21        68   both
1   chicago           14        65   both
2   orlando           35        75   both

In [12]:
df1 = pd.DataFrame({
      "city":["new york","chicago","orlando","baltimore"],
      "temperature": [21,14,35,38],
      "humidity": [65,68,71,75]
  })
df1

        city  temperature  humidity
0   new york           21        65
1    chicago           14        68
2    orlando           35        71
3  baltimore           38        75

In [13]:
df2 = pd.DataFrame({
    "city": ["chicago","new york","san diego"],
    "temperature": [21,14,35],
    "humidity": [65,68,71]
})
df2

        city  temperature  humidity
0    chicago           21        65
1   new york           14        68
2  san diego           35        71

In [14]:
df3 = pd.merge(df1,df2,on="city", suffixes=('_left','_right'))
df3

,city,temperature_left,humidity_left,temperature_right,humidity_right
0,new york,21,65,14,68
1,chicago,14,68,21,65